# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Utils
brew 'ack'
brew 'git'
brew 'git-extras'
brew 'httpie'
brew 'hub'
brew 'irssi'
brew 'jq'
brew 'lynx'
brew 'mas'
brew 'mitmproxy'
brew 'mtr'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'openssl@1.1'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'ruby-build'
brew 'shellcheck'
brew 'speedtest_cli'
brew 'sqlite'
brew 'tmux'
brew 'yarn'

# Casks
cask 'alfred'
cask 'atom'
cask 'eclipse-java'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'jad'
cask 'java'

# Quicklook extensions
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
# plain text formats
cask 'qlstephen'

# Fonts
cask 'font-input'
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
